In [63]:
#Naiive Bayes Algorithm

# P(queen|diamond) = (diamond|queen) * P(queen) / P(diamond)

# P(diamond|queen) = 1/4
# P(queen) = 1/13
# P(diamond) = 1/4
# P(queen | diamond) = 1/4 * 1/13 / 1/4
#                   = 1/13

# For example, in Titanic dataset, 
# P(Survived | Male & Class & Age & Cabin & Fare) 

# Why Naiive Bayes? because it assumes that all features are 
# independent of each other 

# 3 kinds of algorithms: gaussian, bernoulli, and mutinomial

In [64]:
import pandas as pd
df = pd.read_csv('C:\\Users\\yashh\\OneDrive\\Desktop\\CS 4375\\Logistic Regression\\titanic.csv')
df.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [65]:
df.drop(1309, axis=0, inplace=True)

In [66]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [67]:
df.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [68]:
target = df.survived
features = df.drop('survived', axis='columns')

In [69]:
dummies = pd.get_dummies(features.sex)
dummies.head()

   female  male
0       1     0
1       0     1
2       1     0
3       0     1
4       1     0

In [70]:
features = pd.concat([features, dummies], axis='columns')

In [71]:
features.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,female,male
0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1,0
1,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0,1
2,1.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0
3,1.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0,1
4,1.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0

In [72]:
features.drop('sex', axis='columns', inplace=True)

In [73]:
features.columns[features.isna().any()]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [74]:
features.age[:20]

0     29.0000
1      0.9167
2      2.0000
3     30.0000
4     25.0000
5     48.0000
6     63.0000
7     39.0000
8     53.0000
9     71.0000
10    47.0000
11    18.0000
12    24.0000
13    26.0000
14    80.0000
15        NaN
16    24.0000
17    50.0000
18    32.0000
19    36.0000
Name: age, dtype: float64

In [75]:
features.columns

Index(['pclass', 'name', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin',
       'embarked', 'boat', 'body', 'home.dest', 'female', 'male'],
      dtype='object')

In [76]:
features.drop(['name', 'sibsp', 'parch', 'ticket', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], axis='columns', inplace=True)

In [77]:
features.head()

   pclass      age      fare  female  male
0     1.0  29.0000  211.3375       1     0
1     1.0   0.9167  151.5500       0     1
2     1.0   2.0000  151.5500       1     0
3     1.0  30.0000  151.5500       0     1
4     1.0  25.0000  151.5500       1     0

In [78]:
features.columns[features.isna().any()]

Index(['age', 'fare'], dtype='object')

In [79]:
features.fare = features.fare.fillna(features.fare.mean())

In [80]:
features.age = features.age.fillna(features.age.mean())

In [81]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(features, target, test_size = 0.2, random_state = 101)

In [82]:
len(X_train)

1047

In [83]:
len(features)

1309

In [84]:
from sklearn.naive_bayes import GaussianNB, MultinomialNB, BernoulliNB
modelG = GaussianNB()
modelM = MultinomialNB()
modelB = BernoulliNB()

In [85]:
modelG.fit(X_train, y_train)
modelM.fit(X_train, y_train)
modelB.fit(X_train, y_train)

BernoulliNB()

In [86]:
print(modelG.score(X_train, y_train))
print(modelM.score(X_train, y_train))
print(modelB.score(X_train, y_train))

0.7650429799426934
0.6962750716332379
0.772683858643744